In [1]:
import pandas as pd

### APPLES - Data Cleaning and Transforming

In [2]:
url = 'https://en.wikipedia.org/wiki/Apple'

In [3]:
tables = pd.read_html(url)

In [4]:
apple_df = tables[3]

In [5]:
apple_df = apple_df.dropna()

In [6]:
apple_df = apple_df.drop([34,35,36])

In [7]:
apple_df = apple_df.rename(columns={'Nutritional value per 100 g (3.5 oz)': 'Nutrition',
                        'Nutritional value per 100 g (3.5 oz).1': 'Nutritional value per 100 g'})

In [8]:
apple_df.loc[0] = ["Commodity", "APPLES"]

In [9]:
apple_df = apple_df.set_index('Nutrition')
apple_df.head()

              Nutritional value per 100 g
Nutrition
Commodity                          APPLES
Carbohydrates                     13.81 g
Sugars                              10.39
Dietary fiber                       2.4 g
Fat                                0.17 g

In [10]:
apple_df = apple_df.transpose()
apple_df

Nutrition,Commodity,Carbohydrates,Sugars,Dietary fiber,Fat,Protein,Vitamins,Vitamin A equiv.beta-Carotenelutein zeaxanthin,Thiamine (B1),Riboflavin (B2),...,Calcium,Iron,Magnesium,Manganese,Phosphorus,Potassium,Sodium,Zinc,Other constituents,Water
Nutritional value per 100 g,APPLES,13.81 g,10.39,2.4 g,0.17 g,0.26 g,Quantity %DV†,0% 3 μg0%27 μg29 μg,1% 0.017 mg,2% 0.026 mg,...,1% 6 mg,1% 0.12 mg,1% 5 mg,2% 0.035 mg,2% 11 mg,2% 107 mg,0% 1 mg,0% 0.04 mg,Quantity,85.56 g

In [11]:
# Create a filtered dataframe from specific columns
apple_cols = ["Commodity", "Carbohydrates", "Sugars","Fat","Protein", "Calcium"]
apple_transformed= apple_df[apple_cols].copy()

#Rename the column headers
apple_transformed = apple_transformed.rename(columns={
                                                      "Commodity": "id"
                                                     })

apple_transformed

Nutrition,id,Carbohydrates,Sugars,Fat,Protein,Calcium
Nutritional value per 100 g,APPLES,13.81 g,10.39,0.17 g,0.26 g,1% 6 mg

In [12]:
apple_country = tables[2]
apple_country.head()

  Apple production – 2018
                  Country (millions of tonnes)
0                   China                 39.2
1           United States                  4.7
2                  Poland                  4.0
3                  Turkey                  3.6
4                    Iran                  2.5

In [13]:
apple_country.columns = apple_country.columns.get_level_values(1)
apple_country.head()

         Country (millions of tonnes)
0          China                 39.2
1  United States                  4.7
2         Poland                  4.0
3         Turkey                  3.6
4           Iran                  2.5

In [14]:
apple_top3 = apple_country.iloc[0:3]
apple_top3

         Country (millions of tonnes)
0          China                 39.2
1  United States                  4.7
2         Poland                  4.0

In [15]:
apple_top3 = apple_top3.rename(columns={'(millions of tonnes)': 'millions_of_tonnes','Country': 'country'})
apple_top3

         country millions_of_tonnes
0          China               39.2
1  United States                4.7
2         Poland                4.0

In [16]:
apple_top3.insert(0, "commodity", ["APPLE","APPLE","APPLE"], True)
apple_top3

  commodity        country millions_of_tonnes
0     APPLE          China               39.2
1     APPLE  United States                4.7
2     APPLE         Poland                4.0

In [17]:
# Read apple price table
filepath = "apple.csv"
apple_price = pd.read_csv(filepath)
apple_price.head()

,Date,Region,Class,Commodity,Variety,Organic,Environment,Unit,Number of Stores,Weighted Avg Price,Low Price,High Price,% Marked Local
0,11/6/2020,SOUTHWEST U.S.,FRUITS,APPLES,FUJI,NaN,NaN,3 lb bag,260,3.50,3.50,3.50,NaN
1,11/6/2020,SOUTHWEST U.S.,FRUITS,APPLES,FUJI,NaN,NaN,5 lb bag,219,3.55,2.99,3.99,NaN
2,11/6/2020,SOUTHWEST U.S.,FRUITS,APPLES,FUJI,NaN,NaN,per pound,"1,554",1.22,0.50,1.49,20.0
3,11/6/2020,SOUTHWEST U.S.,FRUITS,APPLES,FUJI,Y,NaN,2 lb bag,146,2.50,2.50,2.50,NaN
4,11/6/2020,SOUTHWEST U.S.,FRUITS,APPLES,FUJI,Y,NaN,3 lb bag,113,3.99,3.99,3.99,NaN

In [18]:
# Create a filtered dataframe from specific columns
price_cols = ["Date", "Region", "Commodity","Variety","Unit", "Weighted Avg Price"]
price_transformed= apple_price[price_cols].copy()
# Rename the column headers
price_transformed = price_transformed.rename(columns={"Date":"date",
                                                      "Region":"region",
                                                      "Commodity":"commodity",
                                                      "Variety":"variety",
                                                      "Unit":"unit",
                                                      "Weighted Avg Price":"weighted_avg_price"
                                                     })

price_transformed.head()

        date          region commodity variety       unit  weighted_avg_price
0  11/6/2020  SOUTHWEST U.S.    APPLES    FUJI   3 lb bag                3.50
1  11/6/2020  SOUTHWEST U.S.    APPLES    FUJI   5 lb bag                3.55
2  11/6/2020  SOUTHWEST U.S.    APPLES    FUJI  per pound                1.22
3  11/6/2020  SOUTHWEST U.S.    APPLES    FUJI   2 lb bag                2.50
4  11/6/2020  SOUTHWEST U.S.    APPLES    FUJI   3 lb bag                3.99

### BANANAS - Data Cleaning and Transforming

In [19]:
url_2 = 'https://en.wikipedia.org/wiki/Banana'

In [20]:
tables = pd.read_html(url_2)

In [21]:
banana_df = tables[2]

In [22]:
banana_df = banana_df.dropna()

In [23]:
banana_df = banana_df.drop([31,32,33])

In [24]:
banana_df = banana_df.rename(columns={'Nutritional value per 100 g (3.5 oz)': 'Nutrition',
                        'Nutritional value per 100 g (3.5 oz).1': 'Nutritional value per 100 g'})

In [25]:
banana_df = banana_df.set_index('Nutrition')

In [26]:
banana_df = banana_df.transpose()

In [27]:
banana_df.insert(0, "Commodity", ["BANANAS"], True)

In [28]:
banana_df

Nutrition,Commodity,Energy,Carbohydrates,Sugars,Dietary fiber,Fat,Protein,Vitamins,Thiamine (B1),Riboflavin (B2),...,Minerals,Iron,Magnesium,Manganese,Phosphorus,Potassium,Sodium,Zinc,Other constituents,Water
Nutritional value per 100 g,BANANAS,371 kJ (89 kcal),22.84 g,12.23 g,2.6 g,0.33 g,1.09 g,Quantity %DV†,3% 0.031 mg,6% 0.073 mg,...,Quantity %DV†,2% 0.26 mg,8% 27 mg,13% 0.27 mg,3% 22 mg,8% 358 mg,0% 1 mg,2% 0.15 mg,Quantity,74.91 g

In [29]:
bananas_country = tables[1]
bananas_country.head()

    Unnamed: 0 Bananas Plantains Total
0        India    30.5       NaN  30.5
1        China    11.2       NaN  11.2
2  Philippines     6.1       3.1   9.2
3     Colombia     3.8       3.6   7.4
4    Indonesia     7.2       NaN   7.2

In [30]:
bananas_top3 = bananas_country.iloc[0:3]
bananas_top3

    Unnamed: 0 Bananas Plantains Total
0        India    30.5       NaN  30.5
1        China    11.2       NaN  11.2
2  Philippines     6.1       3.1   9.2

In [31]:
bananas_top3 = bananas_top3[["Unnamed: 0","Bananas"]]
bananas_top3

    Unnamed: 0 Bananas
0        India    30.5
1        China    11.2
2  Philippines     6.1

In [32]:
bananas_top3 = bananas_top3.rename(columns={'Unnamed: 0': 'country','Bananas': 'millions_of_tonnes'})
bananas_top3

       country millions_of_tonnes
0        India               30.5
1        China               11.2
2  Philippines                6.1

In [33]:
bananas_top3.insert(0, "commodity", ["BANANAS","BANANAS","BANANAS"], True)
bananas_top3

  commodity      country millions_of_tonnes
0   BANANAS        India               30.5
1   BANANAS        China               11.2
2   BANANAS  Philippines                6.1

In [34]:
# Read apple price table
filepath_2 = "bananas.csv"
bananas_price = pd.read_csv(filepath_2)
bananas_price

,Date,Region,Class,Commodity,Variety,Organic,Environment,Unit,Number of Stores,Weighted Avg Price,Low Price,High Price,% Marked Local
0,11/6/2020,SOUTHWEST U.S.,FRUITS,BANANAS,NaN,NaN,NaN,per pound,251,0.53,0.33,0.79,NaN

In [35]:
# Create a filtered dataframe from specific columns
price_cols = ["Date", "Region", "Commodity","Variety","Unit", "Weighted Avg Price"]
bananas_transformed= bananas_price[price_cols].copy()
# Rename the column headers
bananas_transformed = price_transformed.rename(columns={"Date":"date",
                                                      "Region":"region",
                                                      "Commodity":"commodity",
                                                      "Variety":"variety",
                                                      "Unit":"unit",
                                                      "Weighted Avg Price":"weighted_avg_price"
                                                     })

bananas_transformed.head()

        date          region commodity variety       unit  weighted_avg_price
0  11/6/2020  SOUTHWEST U.S.    APPLES    FUJI   3 lb bag                3.50
1  11/6/2020  SOUTHWEST U.S.    APPLES    FUJI   5 lb bag                3.55
2  11/6/2020  SOUTHWEST U.S.    APPLES    FUJI  per pound                1.22
3  11/6/2020  SOUTHWEST U.S.    APPLES    FUJI   2 lb bag                2.50
4  11/6/2020  SOUTHWEST U.S.    APPLES    FUJI   3 lb bag                3.99

### Connect to local database

In [36]:
from sqlalchemy import create_engine

In [37]:
connection_string = "postgres:postgres@localhost:5432/produce_db"
engine = create_engine(f'postgresql://{connection_string}')

### Check for tables

In [38]:
# Confirm tables
engine.table_names()

['apple_country', 'apple_price']

### Use pandas to load csv converted DataFrame into database

In [39]:
apple_top3.to_sql(name='apple_country', con=engine, if_exists='append', index=True)

In [40]:
price_transformed.to_sql(name='apple_price', con=engine, if_exists='append', index=True)

In [41]:
bananas_top3.to_sql(name='apple_country', con=engine, if_exists='append', index=True)

In [42]:
bananas_transformed.to_sql(name='apple_price', con=engine, if_exists='append', index=True)

### BEETS - Data Cleaning and Transforming

In [43]:
url_2 = 'https://en.wikipedia.org/wiki/Beetroot'

In [44]:
tables = pd.read_html(url_2)

In [45]:
beet_df = tables[1]

In [46]:
beet_df = beet_df.dropna()
beet_df.head()

  Nutritional value per 100 g (3.5 oz) Nutritional value per 100 g (3.5 oz).1
0                               Energy                       180 kJ (43 kcal)
2                        Carbohydrates                                 9.56 g
3                               Sugars                                 6.76 g
4                        Dietary fiber                                  2.8 g
6                                  Fat                                 0.17 g

### PEPPER BELLS - Data Cleaning and Transforming

In [47]:
url_3 = 'https://en.wikipedia.org/wiki/Bell_pepper'

In [48]:
tables = pd.read_html(url_3)

In [49]:
pepper_df = tables[1]

In [50]:
pepper_df = pepper_df.dropna()

In [51]:
pepper_df = pepper_df.drop([34,35,36])
pepper_df.head()

  Nutritional value per 100 g (3.5 oz) Nutritional value per 100 g (3.5 oz).1
0                               Energy                        84 kJ (20 kcal)
2                        Carbohydrates                                 4.64 g
3                               Sugars                                  2.4 g
4                        Dietary fiber                                  1.8 g
6                                  Fat                                 0.17 g

### BROCCOLI - Data Cleaning and Transforming

In [52]:
url_4 ="https://en.wikipedia.org/wiki/Broccoli"

In [53]:
tables = pd.read_html(url_4)

In [54]:
broccoli_df = tables[2]

In [55]:
broccoli_df = broccoli_df.dropna()

In [56]:
broccoli_df = broccoli_df.drop([35,36,37])
broccoli_df.head()

  Nutritional value per 100 g (3.5 oz) Nutritional value per 100 g (3.5 oz).1
0                               Energy                       141 kJ (34 kcal)
2                        Carbohydrates                                 6.64 g
3                               Sugars                                  1.7 g
4                        Dietary fiber                                  2.6 g
6                                  Fat                                 0.37 g

In [57]:
broccoli_country = tables[1]
broccoli_country

  Broccoli production — 2017(includes cauliflower)  \
                                           Country
0                                            China
1                                            India
2                                    United States
3                                            Spain
4                                           Mexico
5                                            Italy
6                                            World
7         Source: FAOSTAT of the United Nations[4]


               Productionmillions of tonnes
0                                      10.4
1                                       8.6
2                                       1.3
3                                       0.7
4                                       0.7
5                                       0.4
6                                      26.0
7  Source: FAOSTAT of the United Nations[4]

In [58]:
broccoli_country.columns = broccoli_country.columns.get_level_values(1)
broccoli_country.head()

         Country Productionmillions of tonnes
0          China                         10.4
1          India                          8.6
2  United States                          1.3
3          Spain                          0.7
4         Mexico                          0.7

In [59]:
broccoli_top3 = broccoli_country.iloc[0:3]
broccoli_top3

         Country Productionmillions of tonnes
0          China                         10.4
1          India                          8.6
2  United States                          1.3

In [60]:
broccoli_top3 = broccoli_top3.rename(columns={'Country': 'counrty','Productionmillions of tonnes': 'millions_of_tonnes'})
broccoli_top3

         counrty millions_of_tonnes
0          China               10.4
1          India                8.6
2  United States                1.3